import 'package:flutter/material.dart';
class doaa extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    TextStyle st= TextStyle(color: Colors.amber,fontSize: 16) ;
    return   Directionality(
      textDirection: TextDirection.rtl,
      child: Scaffold(
          backgroundColor: Colors.blueGrey,
          appBar: AppBar(
            title: Text("دعاء خاتم القرآن"),

          ),
          body:SingleChildScrollView(
            child: Padding(
              padding: const EdgeInsets.all(8.0),
              child: Column(children: <Widget>[
                Text("دعاء ختم القرآن الكريم .. لم يرد عن الرسول صلى الله عليه وسلم دعاء ثابت لختم القرآن الكريم، غير أنه صلى الله عليه وسلم كان يجمع أهل بيته بعد ختم القرآن الكريم ويدعو بالأدعية الجامعة، لما روى عن أنس رضى الله عنه.",style: st,),

                Text("دعاء ختم القرآن الكريم المكتوب فى عدد من طبعات المصاحف لم يرد أيضًا عن النبى صلى الله عليه وسلم، وإنما هو دعاء لابن تيمية لم ينكره أحد، ولعل من أشهر أدعية ختم القرآن الكريم ما يلى:اللهم ذكرنى منه مانسيت وعلمنى منه ماجهلت وارزقنى تلاوته آناء الليل وأطراف النهار وأجعله لى حجة يارب العالمين .اللهم ارحمنى بالقرآن وأجعله لى إماما ونورا وهدى ورحمة.اللهم أصلح لى دينى الذى هو عصمة أمرى، وأصلح لى دنياى التى فيها معاشى، وأصلح لى آخرتى التى فيها معادى، وأجعل الحياة زيادة لى فى كل خير وأجعل الموت راحة لى من كل شر ."),
                Text("دعاء ختم القرآن",style: TextStyle(fontWeight: FontWeight.bold),),
              Text("  اللهم أجعل خير عمرى آخره وخير عملى خواتمه وخير أيامى يوم ألقاك فيه .اللهم إنى أسألك عيشة هنية وميتة سوية ومردا غير مخز ولا فاضح .اللهم إنى أسألك خير المسألة وخير الدعاء وخير النجاح وخير العلم وخير العمل وخير الثواب وخير الحياة وخير الممات وثبتنى وثقل موازيني وحقق إيماني وارفع درجتى وتقبل صلاتى واغفر خطيئاتي وأسألك العلا من الجنة .اللهم أحسن عاقبتنا فى الأمور كلها، وأجرنا من خزى الدنيا وعذاب الآخرة .اللهم اقسم لنا من خشيتك ما تحول به بيننا وبين معصيتك ومن طاعتك ما تبلغنا بها جنتك ومن اليقين ما تهون به علينا مصائب الدنيا ومتعنا بأسماعنا وأبصارنا وقوتنا ما أحييتنا واجعله الوارث منا وأجعل ثأرنا على من ظلمنا وانصرنا على من عادانا ولا تجعل مصيبتنا فى ديننا ولا تجعل الدنيا أكبر همنا ولا مبلغ علمنا ولا تسلط علينا من لا يرحمنا .اللهم لا تدع لنا ذنبا إلا غفرته ولا هما إلا فرجته ولا دينا إلا قضيته ولا حاجة من حوائج الدنيا والآخرة إلا قضيتها يا أرحم الراحمين.",style: st,)


              ],
              ),
            ),
          ) ,

      ),
    );
  }
}
